let handler = async (m, { conn }) => {

m.reply(`‌*⎔⋅• ━ ╼╃ ⌬〔﷽〕⌬ ╄╾ ━ •⋅⎔*
*﹝♦️↓ اسـتـمـارة الـدخـول ↓♦️﹞*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*↾🍷↿┊اللـقـب ⇇〔 〕*
*↾🎥↿┊مـن انـمـي ⇇〔 〕*
*↾🎎↿┊بـنـت او ولـد ⇇〔 〕*
*↾🎓↿┊مـن طـرف ⇇〔 〕*
*↾🌅↿┊صـورة للـقـب ⇇〔 〕*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*↾❌↿┊مـمـنـوع الـسـوالـف〕*
*↾❌↿┊مـمـنـوع القاب الـ 18+〕*
*↾❌↿┊مـمـنـوع السـب و الـشـتـم〕*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*
*﹝تـوقـيـع↓📜↓مـمـلكة﹞*
*┊𝐎𝐒𝐀𝐊𝐀 𓆩💧𓆪 𝐊.𝐍.𝐆┊*
*⎔⋅• ━ ╼╃ ◈ 〔💧〕 ◈ ╄╾ ━ •⋅⎔*`)
}
handler.help = ['استماره']
handler.tags = ['infobot']
handle .command = /^(استماره)$/i

export default handler;
