let handler  = async (m, { conn }) => {
conn.reply(m.chat,`*╮─━━⊱MOP⊰━*\n\n*“${pickRandom(global.verdad8)}”*\n\n*╯─━━⊱MOP⊰━*`, m)
}
handler.help = ['لو']
handler.tags = ['fun']
handler.command = /^تحداني/i
export default handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}

 global.verdad8 = [
 "منشن صديقك وقوله كلزق", 
 "اضرب اخوك كف واهرب", 
 "منشن مسؤول القروب وقوله قروبك زق", 
 "منشن لكراش واعترف لها", 
 "'قول لابوك 'انا حامل", 
 "رن على ابوك وقوله بحبك", 
 "صلي على النبي", 
 "رن على الوالده وقولها ابوي متزوج عليكي",  
 "اذا جنبك حد قوله احبك",  
 "روح خذ رضا امك وابوك", 
 "قول لاخوك انا قاعد اخونك",   
 " لو حد جنبك بالقروب اضربه كف",  
 "روح عند اللي بنفسك تشتمخ واشتمه",  
 "ادفع صدقه",  
 "ارسل سورة الفاتحه بالقروب",  
 "خل اخوك يسمع قرأن", 
  "قول الشهاده", 
  "قول لخالك احب اختك اللي خلفتني😂😂😂",  
 "مقلب اخوك انك حزين",  
 "اكثر حد تحبه بالقروب ارسله بوسات بالقروب😘",  
 "اعتذر من اللي زعلتو وتعرف انك غلطان", 
  "كل تمر", 
  "قول للي يستحق يا كلب", 
 "قول احبك رايلي",
"منشن اللي تعترف انه عمك"
 ]